SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
atxy7.menu.WDTtimeout.disabled=Disabled (recommended)
atxy7.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
atxy7.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
atxy7.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
atxy7.menu.WDTtimeout.1second=Window remains open for 1 Second
atxy7.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
atxy7.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
atxy7.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
atxy7.menu.WDTwindow.disabled=No delay before window "opens"
atxy7.menu.WDTwindow.8seconds=8 Second before window "opens"
atxy7.menu.WDTwindow.4seconds=4 Second before window "opens"
atxy7.menu.WDTwindow.2seconds=2 Second before window "opens"
atxy7.menu.WDTwindow.1second=1 Second before window "opens"
atxy7.menu.WDTwindow.500msec=500 millisecond before window "opens"
atxy7.menu.WDTwindow.250msec=250 millisecond before window "opens"
atxy7.menu.WDTwindow.125msec=125 millisecond before window "opens"
atxy7.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
atxy7.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
atxy7.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
atxy7.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
atxy7.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
atxy7.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
atxy7.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
atxy7.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
atxy7.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
atxy7.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
atxy7.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
atxy7.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
atxy7.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
atxy7.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
atxy7.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
atxy7.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
atxy7.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
atxy7.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

##########################################################################
#  Non-bootloader                                                        #
#                                ##    ###      ####   ###  #   #      ###
#  ATtiny3226/3216              #  #  #   #     #   #   #   ##  #    #####
#  ATtiny1626/1616/1606           #   #   # === ####    #   # # #  #######
#  ATtiny826/816/806             #    #   #     #       #   #  ##    #####
#  ATtiny427/416/406            ####   ###      #      ###  #   #      ###
#________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
atxy6.build.text_section_start=.text=0x0
atxy6.build.millistimer=D0
atxy6.build.board=AVR_ATtinyxy6
atxy6.build.clocksource=0
atxy6.build.core=megatinycore
atxy6.build.mrelax= -mrelax
atxy6.build.variant=txy6
atxy6.build.tuned=
atxy6.build.printf=
atxy6.build.wire=MORS
atxy6.build.attachmode=-DCORE_ATTACH_ALL
atxy6.build.mcu=attiny{build.attiny}
atxy6.build.f_cpu={build.speed}000000L
atxy6.build.extra_flags=-DARDUINO_attinyxy6 {build.tuned}
atxy6.build.export_merged_output=false

#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
atxy6.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
atxy6.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy6.bootloader.OSCCFG=0x01
atxy6.bootloader.TCD0CFG_avrdude=
atxy6.bootloader.TCD0CFG_serialupdi=
atxy6.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy6.bootloader.APPEND=0x00
atxy6.bootloader.BOOTEND=0x00
atxy6.bootloader.resetpinbits=01
atxy6.bootloader.avrdudestring=
atxy6.bootloader.serialupdistring=-aerase
atxy6.bootloader.altreset=Alt reset pin not supported on 0/1-series.
atxy6.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy6.build.bootload=
atxy6.build.printfabr=
atxy6.build.attachabr=
atxy6.build.wireabr=
atxy6.build.pwmabr=

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
atxy6.upload.tool=avrdude
atxy6.upload.workaround=
atxy6.upload.prog_interlock=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 20-pin 0/1-series tinyAVR submenus          #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy6.menu.chip.3226=ATtiny3226
atxy6.menu.chip.3226.bootloader.altreset=11
atxy6.menu.chip.3226.build.board=AVR_ATtiny3226
atxy6.menu.chip.3226.build.millistimer=B1
atxy6.menu.chip.3226.build.attiny=3226
atxy6.menu.chip.3226.upload.maximum_size=32768
atxy6.menu.chip.3226.upload.maximum_data_size=3072
atxy6.menu.chip.3226.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy6.menu.chip.3216=ATtiny3216
atxy6.menu.chip.3216.build.board=AVR_ATtiny3216
atxy6.menu.chip.3216.build.attiny=3216
atxy6.menu.chip.3216.upload.maximum_size=32768
atxy6.menu.chip.3216.upload.maximum_data_size=2048
atxy6.menu.chip.3216.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy6.menu.chip.3216.bootloader.TCD0CFG_serialupdi=4:0x00
atxy6.menu.chip.1626=ATtiny1626
atxy6.menu.chip.1626.bootloader.altreset=11
atxy6.menu.chip.1626.build.board=AVR_ATtiny1626
atxy6.menu.chip.1626.build.millistimer=B1
atxy6.menu.chip.1626.build.attiny=1626
atxy6.menu.chip.1626.upload.maximum_size=16384
atxy6.menu.chip.1626.upload.maximum_data_size=2048
atxy6.menu.chip.1626.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy6.menu.chip.1616=ATtiny1616
atxy6.menu.chip.1616.build.board=AVR_ATtiny1616
atxy6.menu.chip.1616.build.attiny=1616
atxy6.menu.chip.1616.upload.maximum_size=16384
atxy6.menu.chip.1616.upload.maximum_data_size=2048
atxy6.menu.chip.1616.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy6.menu.chip.1616.bootloader.TCD0CFG_serialupdi=4:0x00
atxy6.menu.chip.1606=ATtiny1606
atxy6.menu.chip.1606.build.board=AVR_ATtiny1606
atxy6.menu.chip.1606.build.attiny=1606
atxy6.menu.chip.1606.build.millistimer=A0
atxy6.menu.chip.1606.upload.maximum_size=16384
atxy6.menu.chip.1606.upload.maximum_data_size=1024
atxy6.menu.chip.826=ATtiny826
atxy6.menu.chip.826.bootloader.altreset=11
atxy6.menu.chip.826.build.board=AVR_ATtiny826
atxy6.menu.chip.826.build.millistimer=B1
atxy6.menu.chip.826.build.attiny=826
atxy6.menu.chip.826.upload.maximum_size=8192
atxy6.menu.chip.826.build.mrelax=
atxy6.menu.chip.826.upload.maximum_data_size=1024
atxy6.menu.chip.826.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy6.menu.chip.816=ATtiny816
atxy6.menu.chip.816.build.board=AVR_ATtiny816
atxy6.menu.chip.816.build.attiny=816
atxy6.menu.chip.816.upload.maximum_size=8192
atxy6.menu.chip.816.build.mrelax=
atxy6.menu.chip.816.upload.maximum_data_size=512
atxy6.menu.chip.816.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy6.menu.chip.816.bootloader.TCD0CFG_serialupdi=4:0x00
atxy6.menu.chip.806=ATtiny806
atxy6.menu.chip.806.build.board=AVR_ATtiny806
atxy6.menu.chip.806.build.attiny=806
atxy6.menu.chip.806.build.millistimer=A0
atxy6.menu.chip.806.upload.maximum_size=8192
atxy6.menu.chip.806.build.mrelax=
atxy6.menu.chip.806.upload.maximum_data_size=512
atxy6.menu.chip.426=ATtiny426
atxy6.menu.chip.426.bootloader.altreset=11
atxy6.menu.chip.426.build.board=AVR_ATtiny426
atxy6.menu.chip.426.build.millistimer=B1
atxy6.menu.chip.426.build.attiny=426
atxy6.menu.chip.426.upload.maximum_size=4096
atxy6.menu.chip.426.build.mrelax=
atxy6.menu.chip.426.upload.maximum_data_size=512
atxy6.menu.chip.426.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy6.menu.chip.416=ATtiny416
atxy6.menu.chip.416.build.board=AVR_ATtiny416
atxy6.menu.chip.416.build.attiny=416
atxy6.menu.chip.416.upload.maximum_size=4096
atxy6.menu.chip.416.build.mrelax=
atxy6.menu.chip.416.upload.maximum_data_size=256
atxy6.menu.chip.416.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy6.menu.chip.416.bootloader.TCD0CFG_serialupdi=4:0x00
atxy6.menu.chip.406=ATtiny406
atxy6.menu.chip.406.build.board=AVR_ATtiny406
atxy6.menu.chip.406.build.attiny=406
atxy6.menu.chip.406.build.millistimer=A0
atxy6.menu.chip.406.upload.maximum_size=4096
atxy6.menu.chip.406.build.mrelax=
atxy6.menu.chip.406.upload.maximum_data_size=256

