SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
atxy6.menu.WDTtimeout.disabled=Disabled (recommended)
atxy6.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
atxy6.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
atxy6.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
atxy6.menu.WDTtimeout.1second=Window remains open for 1 Second
atxy6.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
atxy6.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
atxy6.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
atxy6.menu.WDTwindow.disabled=No delay before window "opens"
atxy6.menu.WDTwindow.8seconds=8 Second before window "opens"
atxy6.menu.WDTwindow.4seconds=4 Second before window "opens"
atxy6.menu.WDTwindow.2seconds=2 Second before window "opens"
atxy6.menu.WDTwindow.1second=1 Second before window "opens"
atxy6.menu.WDTwindow.500msec=500 millisecond before window "opens"
atxy6.menu.WDTwindow.250msec=250 millisecond before window "opens"
atxy6.menu.WDTwindow.125msec=125 millisecond before window "opens"
atxy6.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
atxy6.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
atxy6.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
atxy6.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
atxy6.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
atxy6.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
atxy6.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
atxy6.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
atxy6.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
atxy6.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
atxy6.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
atxy6.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
atxy6.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
atxy6.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
atxy6.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
atxy6.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
atxy6.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
atxy6.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

##########################################################################
#  Non-bootloader                                                        #
#                                #    #  #     ####   ###  #   #       ###
#  ATtiny3224/1614/1604         ##    #  #     #   #   #   ##  #     #####
#  ATtiny1624/814/804            #    #### === ####    #   # # #   #######
#  ATtiny824/414/404             #       #     #       #   #  ##     #####
#  ATtiny424/214/204            ###      #     #      ###  #   #       ###
#________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
atxy4.build.text_section_start=.text=0x0
atxy4.build.millistimer=D0
atxy4.build.board=AVR_ATtinyxy4
atxy4.build.clocksource=0
atxy4.build.core=megatinycore
atxy4.build.mrelax= -mrelax
atxy4.build.variant=txy4
atxy4.build.tuned=
atxy4.build.printf=
atxy4.build.wire=MORS
atxy4.build.attachmode=-DCORE_ATTACH_ALL
atxy4.build.mcu=attiny{build.attiny}
atxy4.build.f_cpu={build.speed}000000L
atxy4.build.extra_flags=-DARDUINO_attinyxy4 {build.tuned}
atxy4.build.export_merged_output=false

#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
atxy4.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
atxy4.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy4.bootloader.OSCCFG=0x01
atxy4.bootloader.TCD0CFG_avrdude=
atxy4.bootloader.TCD0CFG_serialupdi=
atxy4.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy4.bootloader.APPEND=0x00
atxy4.bootloader.BOOTEND=0x00
atxy4.bootloader.resetpinbits=01
atxy4.bootloader.avrdudestring=
atxy4.bootloader.serialupdistring=-aerase
atxy4.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy4.build.bootload=
atxy4.build.printfabr=
atxy4.build.attachabr=
atxy4.build.wireabr=
atxy4.build.pwmabr=

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
atxy4.upload.tool=avrdude
atxy4.upload.workaround=
atxy4.upload.prog_interlock=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 14-pin 0/1-series tinyAVR submenus          #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy4.menu.chip.3224=ATtiny3224
atxy4.menu.chip.3224.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy4.menu.chip.3224.build.board=AVR_ATtiny3224
atxy4.menu.chip.3224.build.millistimer=B1
atxy4.menu.chip.3224.build.attiny=3224
atxy4.menu.chip.3224.upload.maximum_size=32768
atxy4.menu.chip.3224.upload.maximum_data_size=3072
atxy4.menu.chip.1624=ATtiny1624
atxy4.menu.chip.1624.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy4.menu.chip.1624.build.board=AVR_ATtiny1624
atxy4.menu.chip.1624.build.millistimer=B1
atxy4.menu.chip.1624.build.attiny=1624
atxy4.menu.chip.1624.upload.maximum_size=16384
atxy4.menu.chip.1624.upload.maximum_data_size=2048
atxy4.menu.chip.1614=ATtiny1614
atxy4.menu.chip.1614.build.board=AVR_ATtiny1614
atxy4.menu.chip.1614.build.attiny=1614
atxy4.menu.chip.1614.upload.maximum_size=16384
atxy4.menu.chip.1614.upload.maximum_data_size=2048
atxy4.menu.chip.1614.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy4.menu.chip.1614.bootloader.TCD0CFG_serialupdi=4:0x00
atxy4.menu.chip.1604=ATtiny1604
atxy4.menu.chip.1604.build.board=AVR_ATtiny1604
atxy4.menu.chip.1604.build.attiny=1604
atxy4.menu.chip.1604.build.millistimer=A0
atxy4.menu.chip.1604.upload.maximum_size=16384
atxy4.menu.chip.1604.upload.maximum_data_size=1024
atxy4.menu.chip.824=ATtiny824
atxy4.menu.chip.824.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy4.menu.chip.824.build.board=AVR_ATtiny824
atxy4.menu.chip.824.build.millistimer=B1
atxy4.menu.chip.824.build.attiny=824
atxy4.menu.chip.824.upload.maximum_size=8192
atxy4.menu.chip.824.build.mrelax=
atxy4.menu.chip.824.upload.maximum_data_size=1024
atxy4.menu.chip.814=ATtiny814
atxy4.menu.chip.814.build.board=AVR_ATtiny814
atxy4.menu.chip.814.build.attiny=814
atxy4.menu.chip.814.upload.maximum_size=8192
atxy4.menu.chip.814.build.mrelax=
atxy4.menu.chip.814.upload.maximum_data_size=512
atxy4.menu.chip.814.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy4.menu.chip.814.bootloader.TCD0CFG_serialupdi=4:0x00
atxy4.menu.chip.804=ATtiny804
atxy4.menu.chip.804.build.board=AVR_ATtiny804
atxy4.menu.chip.804.build.attiny=804
atxy4.menu.chip.804.build.millistimer=A0
atxy4.menu.chip.804.upload.maximum_size=8192
atxy4.menu.chip.804.build.mrelax=
atxy4.menu.chip.804.upload.maximum_data_size=512
atxy4.menu.chip.424=ATtiny424
atxy4.menu.chip.424.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy4.menu.chip.424.build.board=AVR_ATtiny424
atxy4.menu.chip.424.build.millistimer=B1
atxy4.menu.chip.424.build.attiny=424
atxy4.menu.chip.424.upload.maximum_size=4096
atxy4.menu.chip.424.build.mrelax=
atxy4.menu.chip.424.upload.maximum_data_size=512
atxy4.menu.chip.414=ATtiny414
atxy4.menu.chip.414.build.board=AVR_ATtiny414
atxy4.menu.chip.414.build.attiny=414
atxy4.menu.chip.414.upload.maximum_size=4096
atxy4.menu.chip.414.build.mrelax=
atxy4.menu.chip.414.upload.maximum_data_size=256
atxy4.menu.chip.414.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy4.menu.chip.414.bootloader.TCD0CFG_serialupdi=4:0x00
atxy4.menu.chip.404=ATtiny404
atxy4.menu.chip.404.build.board=AVR_ATtiny404
atxy4.menu.chip.404.build.attiny=404
atxy4.menu.chip.404.build.millistimer=A0
atxy4.menu.chip.404.upload.maximum_size=4096
atxy4.menu.chip.404.build.mrelax=
atxy4.menu.chip.404.upload.maximum_data_size=256
atxy4.menu.chip.214=ATtiny214
atxy4.menu.chip.214.build.board=AVR_ATtiny214
atxy4.menu.chip.214.build.attiny=214
atxy4.menu.chip.214.upload.maximum_size=2048
atxy4.menu.chip.214.build.mrelax=
atxy4.menu.chip.214.upload.maximum_data_size=128
atxy4.menu.chip.214.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy4.menu.chip.214.bootloader.TCD0CFG_serialupdi=4:0x00
atxy4.menu.chip.204=ATtiny204
atxy4.menu.chip.204.build.board=AVR_ATtiny204
atxy4.menu.chip.204.build.attiny=204
atxy4.menu.chip.204.build.millistimer=A0
atxy4.menu.chip.204.upload.maximum_size=2048
atxy4.menu.chip.204.build.mrelax=
atxy4.menu.chip.204.upload.maximum_data_size=128

