SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
atxy4.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy4.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy4.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy4.menu.bodvoltage.2v1=2.1V (Unofficial)
atxy4.menu.bodvoltage.2v9=2.9V (Unofficial)
atxy4.menu.bodvoltage.3v3=3.3V (Unofficial)
atxy4.menu.bodvoltage.3v7=3.7V (Unofficial)
atxy4.menu.bodvoltage.4v0=4.0V (Unofficial)
atxy4.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy4.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy4.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy4.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy4.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy4.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy4.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy4.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
atxy4.menu.bodmode.disabled=Disabled/Disabled
atxy4.menu.bodmode.enabled=Enabled/Enabled
atxy4.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy4.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy4.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy4.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy4.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy4.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy4.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy4.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy4.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy4.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy4.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy4.menu.bodmode.sampledfast.bootloader.bodmodebits=01010
atxy4.menu.bodmode.sampledlow.bootloader.bodmodebits=11010
atxy4.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy4.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy4.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# EEPROM RETAIN                          #
#________________________________________#
atxy4.menu.eesave.enable=EEPROM retained
atxy4.menu.eesave.enable.bootloader.eesavebit=1
atxy4.menu.eesave.disable=EEPROM not retained
atxy4.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atxy4.menu.millis.enabled=Enabled (default timer)
atxy4.menu.millis.disabled=Disabled (saves flash)
atxy4.menu.millis.timera=TCA0 (default on 0-series)
atxy4.menu.millis.timerd=TCD0 (1-series only, default there)
atxy4.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy4.menu.millis.timerb1=TCB1 (1614, 2-series only)
atxy4.menu.millis.rtc=RTC (no micros)
atxy4.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy4.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only no micros)
atxy4.menu.millis.disabled.build.millistimer=NONE
atxy4.menu.millis.timera.build.millistimer=A0
atxy4.menu.millis.timerd.build.millistimer=D0
atxy4.menu.millis.timerb0.build.millistimer=B0
atxy4.menu.millis.timerb1.build.millistimer=B1
atxy4.menu.millis.rtc.build.millistimer=RTC
atxy4.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy4.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# UPDI/RESET PIN CONFIGURATION           #
#________________________________________#
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#atxy4.menu.resetpin.UPDI=UPDI (no reset pin)
#atxy4.menu.resetpin.UPDI.bootloader.resetpinbits=01
#atxy4.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#atxy4.menu.resetpin.reset.bootloader.resetpinbits=10
#atxy4.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#atxy4.menu.resetpin.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atxy4.menu.startuptime.8=8ms
atxy4.menu.startuptime.0=0ms
atxy4.menu.startuptime.1=1ms
atxy4.menu.startuptime.2=2ms
atxy4.menu.startuptime.4=4ms
atxy4.menu.startuptime.16=16ms
atxy4.menu.startuptime.32=32ms
atxy4.menu.startuptime.64=64ms
atxy4.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy4.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy4.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy4.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy4.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy4.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy4.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy4.menu.startuptime.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy4.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy4.menu.wiremode.mors.build.wire=MORS
atxy4.menu.wiremode.mands=Master and Slave
atxy4.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy4.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy4.menu.printf.full=Full, 2.6k, prints floats
atxy4.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy4.menu.printf.full.build.printfabr=.pfF
atxy4.menu.printf.minimal=Minimal, 1.1k flash used
atxy4.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy4.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy4.menu.attach.allenabled=On all pins, with new implementation.
atxy4.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy4.menu.attach.manual=Only enabled ports
atxy4.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy4.menu.attach.oldversion=Old version, (may fix bugs)
atxy4.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy4.menu.attach.manual.build.attachabr=.aMan
atxy4.menu.attach.oldversion.build.attachabr=.aOld

