SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
atxy4.menu.WDTtimeout.disabled=Disabled (recommended)
atxy4.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
atxy4.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
atxy4.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
atxy4.menu.WDTtimeout.1second=Window remains open for 1 Second
atxy4.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
atxy4.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
atxy4.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
atxy4.menu.WDTwindow.disabled=No delay before window "opens"
atxy4.menu.WDTwindow.8seconds=8 Second before window "opens"
atxy4.menu.WDTwindow.4seconds=4 Second before window "opens"
atxy4.menu.WDTwindow.2seconds=2 Second before window "opens"
atxy4.menu.WDTwindow.1second=1 Second before window "opens"
atxy4.menu.WDTwindow.500msec=500 millisecond before window "opens"
atxy4.menu.WDTwindow.250msec=250 millisecond before window "opens"
atxy4.menu.WDTwindow.125msec=125 millisecond before window "opens"
atxy4.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
atxy4.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
atxy4.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
atxy4.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
atxy4.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
atxy4.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
atxy4.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
atxy4.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
atxy4.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
atxy4.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
atxy4.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
atxy4.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
atxy4.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
atxy4.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
atxy4.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
atxy4.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
atxy4.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
atxy4.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

############################################################################
#  Non-bootloader                                                          #
#                                     ###      ####   ###  #   #         ###
#  ATtiny412                         #   #     #   #   #   ##  #       #####
#  ATtiny402                          ###  === ####    #   # # #     #######
#  ATtiny212                         #   #     #       #   #  ##       #####
#  ATtiny202                          ###      #      ###  #   #         ###
#__________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
atxy2.build.text_section_start=.text=0x0
atxy2.build.millistimer=D0
atxy2.build.board=AVR_ATtinyxy2
atxy2.build.clocksource=0
atxy2.build.core=megatinycore
atxy2.build.mrelax=
atxy2.build.variant=txy2
atxy2.build.mcu=attiny{build.attiny}
atxy2.build.f_cpu={build.speed}000000L
atxy2.build.extra_flags=-DARDUINO_attinyxy2 {build.tuned}
atxy2.build.export_merged_output=false
atxy2.build.tuned=
atxy2.build.printf=
atxy2.build.wire=MORS
atxy2.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
atxy2.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
atxy2.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy2.bootloader.OSCCFG=0x01
atxy2.bootloader.TCD0CFG_avrdude=
atxy2.bootloader.TCD0CFG_serialupdi=
atxy2.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy2.bootloader.APPEND=0x00
atxy2.bootloader.BOOTEND=0x00
atxy2.bootloader.resetpinbits=01
atxy2.bootloader.avrdudestring=
atxy2.bootloader.serialupdistring=-aerase
atxy2.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy2.build.bootload=
atxy2.build.printfabr=
atxy2.build.attachabr=
atxy2.build.wireabr=
atxy2.build.pwmabr=

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
atxy2.upload.tool=avrdude
atxy2.upload.workaround=
atxy2.upload.prog_interlock=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
#  8-pin 0/1-series tinyAVR submenus          #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy2.menu.chip.412=ATtiny412
atxy2.menu.chip.412.build.board=AVR_ATtiny412
atxy2.menu.chip.412.build.attiny=412
atxy2.menu.chip.412.upload.maximum_size=4096
atxy2.menu.chip.412.upload.maximum_data_size=256
atxy2.menu.chip.412.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy2.menu.chip.412.bootloader.TCD0CFG_serialupdi=4:0x00
atxy2.menu.chip.402=ATtiny402
atxy2.menu.chip.402.build.board=AVR_ATtiny402
atxy2.menu.chip.402.build.attiny=402
atxy2.menu.chip.402.build.millistimer=A0
atxy2.menu.chip.402.upload.maximum_size=4096
atxy2.menu.chip.402.upload.maximum_data_size=256
atxy2.menu.chip.402.bootloader.TCD0CFG_avrdude=
atxy2.menu.chip.402.bootloader.TCD0CFG_serialupdi=
atxy2.menu.chip.212=ATtiny212
atxy2.menu.chip.212.build.board=AVR_ATtiny212
atxy2.menu.chip.212.build.attiny=212
atxy2.menu.chip.212.upload.maximum_size=2048
atxy2.menu.chip.212.upload.maximum_data_size=128
atxy2.menu.chip.212.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy2.menu.chip.212.bootloader.TCD0CFG_serialupdi=4:0x00
atxy2.menu.chip.202=ATtiny202
atxy2.menu.chip.202.build.board=AVR_ATtiny202
atxy2.menu.chip.202.build.attiny=202
atxy2.menu.chip.202.build.millistimer=A0
atxy2.menu.chip.202.upload.maximum_size=2048
atxy2.menu.chip.202.upload.maximum_data_size=128
atxy2.menu.chip.202.bootloader.TCD0CFG_avrdude=
atxy2.menu.chip.202.bootloader.TCD0CFG_serialupdi=
atxy2.menu.chip.402w=ATtiny402 (bad signature)
atxy2.menu.chip.402w.build.millistimer=A0
atxy2.menu.chip.402w.build.board=AVR_ATtiny402
atxy2.menu.chip.402w.build.attiny=402
atxy2.menu.chip.402w.upload.maximum_size=4096
atxy2.menu.chip.402w.upload.maximum_data_size=256
atxy2.menu.chip.402w.upload.workaround=w
atxy2.menu.chip.402w.bootloader.TCD0CFG_avrdude=
atxy2.menu.chip.402w.bootloader.TCD0CFG_serialupdi=

