SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atxy2.menu.clock.20internal=20 MHz internal
atxy2.menu.clock.16internal=16 MHz internal
atxy2.menu.clock.10internal=10 MHz internal
atxy2.menu.clock.8internal=8 MHz internal
atxy2.menu.clock.5internal=5 MHz internal
atxy2.menu.clock.4internal=4 MHz internal
atxy2.menu.clock.2internal=2 MHz internal
atxy2.menu.clock.1internal=1 MHz internal
atxy2.menu.clock.20internaltuned=20 MHz internal - tuned
atxy2.menu.clock.16internaltuned=16 MHz internal - tuned
atxy2.menu.clock.12internaltuned=12 MHz internal - tuned
atxy2.menu.clock.10internaltuned=10 MHz internal - tuned
atxy2.menu.clock.8internaltuned=8 MHz internal - tuned
atxy2.menu.clock.6internaltuned=6 MHz internal - tuned
atxy2.menu.clock.5internaltuned=5 MHz internal - tuned
atxy2.menu.clock.4internaltuned=4 MHz internal - tuned
atxy2.menu.clock.1internaltuned=1 MHz internal - tuned
atxy2.menu.clock.20extclock=20 MHz external clock
atxy2.menu.clock.16extclock=16 MHz external clock
atxy2.menu.clock.12extclock=12 MHz external clock
atxy2.menu.clock.10extclock=10 MHz external clock
atxy2.menu.clock.8extclock=8 MHz external clock
atxy2.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
atxy2.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
atxy2.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy2.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atxy2.menu.clock.24extclock=24 MHz external clock - overclocked
atxy2.menu.clock.25extclock=25 MHz external clock - overclocked
atxy2.menu.clock.30extclock=30 MHz external clock - overclocked, may be unstable
atxy2.menu.clock.32extclock=32 MHz external clock - overclocked, may be unstable
atxy2.menu.clock.20internal.build.speed=20
atxy2.menu.clock.20internal.build.clocksource=0
atxy2.menu.clock.16internal.build.speed=16
atxy2.menu.clock.16internal.build.clocksource=0
atxy2.menu.clock.10internal.build.speed=10
atxy2.menu.clock.10internal.build.clocksource=0
atxy2.menu.clock.8internal.build.speed=8
atxy2.menu.clock.8internal.build.clocksource=0
atxy2.menu.clock.5internal.build.speed=5
atxy2.menu.clock.5internal.build.clocksource=0
atxy2.menu.clock.4internal.build.speed=4
atxy2.menu.clock.4internal.build.clocksource=0
atxy2.menu.clock.2internal.build.speed=2
atxy2.menu.clock.2internal.build.clocksource=0
atxy2.menu.clock.1internal.build.speed=1
atxy2.menu.clock.1internal.build.clocksource=0
atxy2.menu.clock.20extclock.build.speed=20
atxy2.menu.clock.20extclock.build.clocksource=2
atxy2.menu.clock.16extclock.build.speed=16
atxy2.menu.clock.16extclock.build.clocksource=2
atxy2.menu.clock.12extclock.build.speed=12
atxy2.menu.clock.12extclock.build.clocksource=2
atxy2.menu.clock.10extclock.build.speed=10
atxy2.menu.clock.10extclock.build.clocksource=2
atxy2.menu.clock.8extclock.build.speed=8
atxy2.menu.clock.8extclock.build.clocksource=2
atxy2.menu.clock.24extclock.build.speed=24
atxy2.menu.clock.24extclock.build.clocksource=2
atxy2.menu.clock.25extclock.build.speed=24
atxy2.menu.clock.25extclock.build.clocksource=2
atxy2.menu.clock.30extclock.build.speed=30
atxy2.menu.clock.30extclock.build.clocksource=2
atxy2.menu.clock.32extclock.build.speed=32
atxy2.menu.clock.32extclock.build.clocksource=2
atxy2.menu.clock.20internaltuned.build.speed=20
atxy2.menu.clock.20internaltuned.build.clocksource=0
atxy2.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.16internaltuned.build.speed=16
atxy2.menu.clock.16internaltuned.build.clocksource=0
atxy2.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.12internaltuned.build.speed=12
atxy2.menu.clock.12internaltuned.build.clocksource=0
atxy2.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.24internaltuned.build.speed=24
atxy2.menu.clock.24internaltuned.build.clocksource=0
atxy2.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.25internaltuned.build.speed=25
atxy2.menu.clock.25internaltuned.build.clocksource=0
atxy2.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.30internaltuned.build.speed=30
atxy2.menu.clock.30internaltuned.build.clocksource=0
atxy2.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.10internaltuned.build.speed=10
atxy2.menu.clock.10internaltuned.build.clocksource=0
atxy2.menu.clock.10internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.8internaltuned.build.speed=8
atxy2.menu.clock.8internaltuned.build.clocksource=0
atxy2.menu.clock.8internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.6internaltuned.build.speed=6
atxy2.menu.clock.6internaltuned.build.clocksource=0
atxy2.menu.clock.6internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.5internaltuned.build.speed=5
atxy2.menu.clock.5internaltuned.build.clocksource=0
atxy2.menu.clock.5internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.4internaltuned.build.speed=4
atxy2.menu.clock.4internaltuned.build.clocksource=0
atxy2.menu.clock.4internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.1internaltuned.build.speed=1
atxy2.menu.clock.1internaltuned.build.clocksource=0
atxy2.menu.clock.1internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy2.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.12internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.10internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.6internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.5internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
atxy2.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy2.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy2.menu.clock.5internal.bootloader.OSCCFG=0x02

#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
atxy2.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy2.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy2.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy2.menu.bodvoltage.2v1=2.1V (Unofficial)
atxy2.menu.bodvoltage.2v9=2.9V (Unofficial)
atxy2.menu.bodvoltage.3v3=3.3V (Unofficial)
atxy2.menu.bodvoltage.3v7=3.7V (Unofficial)
atxy2.menu.bodvoltage.4v0=4.0V (Unofficial)
atxy2.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy2.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy2.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2.menu.bodvoltage.4v2.bootloader.bodlevbits=111

