SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOD MODE                               #
#________________________________________#
atxy2.menu.bodmode.disabled=Disabled/Disabled
atxy2.menu.bodmode.enabled=Enabled/Enabled
atxy2.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy2.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy2.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy2.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy2.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy2.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy2.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy2.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy2.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy2.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy2.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy2.menu.bodmode.sampledfast.bootloader.bodmodebits=01010
atxy2.menu.bodmode.sampledlow.bootloader.bodmodebits=11010
atxy2.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy2.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy2.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# EEPROM RETAIN                          #
#________________________________________#
atxy2.menu.eesave.enable=EEPROM retained
atxy2.menu.eesave.enable.bootloader.eesavebit=1
atxy2.menu.eesave.disable=EEPROM not retained
atxy2.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atxy2.menu.millis.enabled=Enabled (default timer)
atxy2.menu.millis.disabled=Disabled (saves flash)
atxy2.menu.millis.timera=TCA0 (default on 402/202)
atxy2.menu.millis.timerd=TCD0 (412/212 only, default there)
atxy2.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy2.menu.millis.rtc=RTC (no micros)
atxy2.menu.millis.disabled.build.millistimer=NONE
atxy2.menu.millis.timera.build.millistimer=A0
atxy2.menu.millis.timerd.build.millistimer=D0
atxy2.menu.millis.timerb0.build.millistimer=B0
atxy2.menu.millis.rtc.build.millistimer=RTC

#----------------------------------------#
# UPDI/RESET PIN CONFIGURATION           #
#________________________________________#
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#atxy2.menu.resetpin.UPDI=UPDI (no reset pin)
#atxy2.menu.resetpin.UPDI.bootloader.resetpinbits=01
#atxy2.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#atxy2.menu.resetpin.reset.bootloader.resetpinbits=10
#atxy2.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#atxy2.menu.resetpin.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atxy2.menu.startuptime.8=8ms
atxy2.menu.startuptime.0=0ms
atxy2.menu.startuptime.1=1ms
atxy2.menu.startuptime.2=2ms
atxy2.menu.startuptime.4=4ms
atxy2.menu.startuptime.16=16ms
atxy2.menu.startuptime.32=32ms
atxy2.menu.startuptime.64=64ms
atxy2.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy2.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy2.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy2.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy2.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy2.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy2.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy2.menu.startuptime.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy2.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy2.menu.wiremode.mors.build.wire=MORS
atxy2.menu.wiremode.mands=Master and Slave  (412 and 212 only)
atxy2.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy2.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy2.menu.printf.full=Full, 2.6k, prints floats
atxy2.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy2.menu.printf.full.build.printfabr=.pfF
atxy2.menu.printf.minimal=Minimal, 1.1k flash used
atxy2.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy2.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy2.menu.attach.allenabled=On all pins, with new implementation.
atxy2.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy2.menu.attach.manual=Only enabled ports
atxy2.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy2.menu.attach.oldversion=Old version, (may fix bugs)
atxy2.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy2.menu.attach.manual.build.attachabr=.aMan
atxy2.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
atxy2.menu.WDTtimeout.disabled=Disabled (recommended)
atxy2.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
atxy2.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
atxy2.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
atxy2.menu.WDTtimeout.1second=Window remains open for 1 Second
atxy2.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
atxy2.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
atxy2.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
atxy2.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
atxy2.menu.WDTwindow.disabled=No delay before window "opens"
atxy2.menu.WDTwindow.8seconds=8 Second before window "opens"
atxy2.menu.WDTwindow.4seconds=4 Second before window "opens"
atxy2.menu.WDTwindow.2seconds=2 Second before window "opens"
atxy2.menu.WDTwindow.1second=1 Second before window "opens"
atxy2.menu.WDTwindow.500msec=500 millisecond before window "opens"
atxy2.menu.WDTwindow.250msec=250 millisecond before window "opens"
atxy2.menu.WDTwindow.125msec=125 millisecond before window "opens"
atxy2.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
atxy2.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
atxy2.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
atxy2.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
atxy2.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
atxy2.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
atxy2.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
atxy2.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
atxy2.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
atxy2.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
atxy2.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
atxy2.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
atxy2.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
atxy2.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
atxy2.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
atxy2.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
atxy2.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

############################################################################
#  Non-bootloader                                                          #
# Curiosity Nano    #   # ###  ### ####   ###   ### #  # ### ####        ###
# Xplained Mini     ## ##  #  #    #   # #   # #    #  #  #  #   #     #####
# Xplained Pro      # # #  #  #    ####  #   # #    ####  #  ####    #######
#                   #   #  #  #    # #   #   # #    #  #  #  #         #####
#                   #   # ###  ### #  ##  ###   ### #  # ### #           ###
#__________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
microchip.build.text_section_start=.text=0x0
microchip.build.millistimer=D0
microchip.build.clocksource=0
microchip.build.core=megatinycore
microchip.build.mrelax= -mrelax
microchip.build.variant=txy7
microchip.build.tuned=
microchip.build.board=If you see this, please report this bug promptly. It should never be shown.
microchip.build.printf=
microchip.build.wire=MORS
microchip.build.attachmode=-DCORE_ATTACH_ALL
microchip.build.mcu=attiny{build.attiny}
microchip.build.f_cpu={build.speed}000000L
microchip.build.export_merged_output=false
microchip.build.board=Microchip Placeholder

