SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
microchip.bootloader.WDTCFG=0b0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
microchip.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
microchip.bootloader.OSCCFG=0x01
microchip.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
microchip.bootloader.TCD0CFG_serialupdi=4:0x00
microchip.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
microchip.bootloader.APPEND=0x00
microchip.bootloader.BOOTEND=0x00
microchip.bootloader.resetpinbits=01
microchip.bootloader.altreset=Alt reset not supported on 0/1-series.
microchip.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
microchip.build.bootload=
microchip.build.printfabr=
microchip.build.wireabr=
microchip.build.attachabr=
microchip.build.pwmabr=

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
microchip.upload.tool=avrdude
microchip.upload.workaround=
microchip.upload.prog_interlock=
microchip.upload.extra_params=-Pusb
microchip.upload.serial_params=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# Microchip Official Board submenus           #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
microchip.menu.board_name.cn3217=Curiosity Nano ATtiny3217
microchip.menu.board_name.cn3217.build.board=AVR_CuriosityNano3217
microchip.menu.board_name.cn3217.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PA3 -DPIN_BUTTON_BUILTIN=PIN_PB7 {build.tuned}
microchip.menu.board_name.cn3217.build.attiny=3217
microchip.menu.board_name.cn3217.upload.protocol=curiosity_updi
microchip.menu.board_name.cn3217.upload.maximum_size=32768
microchip.menu.board_name.cn3217.upload.maximum_data_size=2048

microchip.menu.board_name.cn1627=Curiosity Nano ATtiny1627
microchip.menu.board_name.cn1627.build.board=AVR_CuriosityNano1627
microchip.menu.board_name.cn1627.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB7
microchip.menu.board_name.cn1627.build.millistimer=B1
microchip.menu.board_name.cn1627.build.attiny=1627
microchip.menu.board_name.cn1627.upload.protocol=curiosity_updi
microchip.menu.board_name.cn1627.upload.maximum_size=16384
microchip.menu.board_name.cn1627.upload.maximum_data_size=2048
microchip.menu.board_name.cn1627.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
microchip.menu.board_name.cn1627.bootloader.TCD0CFG_avrdude=
microchip.menu.board_name.cn1627.bootloader.TCD0CFG_serialupdi=
microchip.menu.board_name.cn1627.bootloader.altreset=11

microchip.menu.board_name.cn1607=Curiosity Nano ATtiny1607
microchip.menu.board_name.cn1607.build.board=AVR_CuriosityNano1607
microchip.menu.board_name.cn1607.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PC4 -DPIN_BUTTON_BUILTIN=PIN_PB7
microchip.menu.board_name.cn1607.build.attiny=1607
microchip.menu.board_name.cn1607.build.millistimer=A0
microchip.menu.board_name.cn1607.upload.protocol=curiosity_updi
microchip.menu.board_name.cn1607.upload.extra_params=-Pusb
microchip.menu.board_name.cn1607.upload.maximum_size=16384
microchip.menu.board_name.cn1607.upload.maximum_data_size=1024
microchip.menu.board_name.cn1607.bootloader.TCD0CFG_avrdude=
microchip.menu.board_name.cn1607.bootloader.TCD0CFG_serialupdi=

microchip.menu.board_name.xp3217=Xplained Pro ATtiny3217
microchip.menu.board_name.xp3217.build.board=AVR_Xplained_Pro_3217
microchip.menu.board_name.xp3217.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB5
microchip.menu.board_name.xp3217.build.attiny=3217
microchip.menu.board_name.xp3217.build.millistimer=D0
microchip.menu.board_name.xp3217.upload.protocol=xplainedpro_updi
microchip.menu.board_name.xp3217.build.variant=atxy7
microchip.menu.board_name.xp3217.upload.maximum_size=32768
microchip.menu.board_name.xp3217.upload.maximum_data_size=2048

microchip.menu.board_name.xp817=Xplained Pro ATtiny817
microchip.menu.board_name.xp817.build.board=AVR_Xplained_Pro_817
microchip.menu.board_name.xp817.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB5
microchip.menu.board_name.xp817.build.attiny=817
microchip.menu.board_name.xp817.build.millistimer=D0
microchip.menu.board_name.xp817.upload.protocol=xplainedpro_updi
microchip.menu.board_name.xp817.upload.maximum_size=8192
microchip.menu.board_name.xp817.build.mrelax=
microchip.menu.board_name.xp817.upload.maximum_data_size=512

microchip.menu.board_name.xm817=Xplained Mini ATtiny817
microchip.menu.board_name.xm817.build.board=AVR_XplainedMini817
microchip.menu.board_name.xm817.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PC0 -DPIN_BUTTON_BUILTIN=PIN_PC5
microchip.menu.board_name.xm817.build.attiny=817
microchip.menu.board_name.xm817.build.millistimer=D0
microchip.menu.board_name.xm817.upload.protocol=xplainedmini_updi
microchip.menu.board_name.xm817.upload.maximum_size=8192
microchip.menu.board_name.xm817.build.mrelax=
microchip.menu.board_name.xm817.upload.maximum_data_size=512

microchip.menu.board_name.xn416=Xplained Nano ATtiny416
microchip.menu.board_name.xn416.build.board=AVR_XplainedNano416
microchip.menu.board_name.xn416.build.extra_flags=-DARDUINO_attinyxy6 -DLED_BUILTIN=PIN_PB5 -DPIN_BUTTON_BUILTIN=PIN_PB4 -DUART0_SWAP
microchip.menu.board_name.xn416.build.attiny=416
microchip.menu.board_name.xn416.build.variant=txy6
microchip.menu.board_name.xn416.build.millistimer=A0
microchip.menu.board_name.xn416.upload.protocol=xplainedmini_updi
microchip.menu.board_name.xn416.upload.maximum_size=4096
microchip.menu.board_name.xn416.build.mrelax=
microchip.menu.board_name.xn416.upload.maximum_data_size=256

