SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
microchip.menu.clock.20internal=20 MHz internal
microchip.menu.clock.16internal=16 MHz internal
microchip.menu.clock.10internal=10 MHz internal
microchip.menu.clock.8internal=8 MHz internal
microchip.menu.clock.5internal=5 MHz internal
microchip.menu.clock.4internal=4 MHz internal
microchip.menu.clock.2internal=2 MHz internal
microchip.menu.clock.1internal=1 MHz internal
microchip.menu.clock.20internaltuned=20 MHz internal - tuned
microchip.menu.clock.16internaltuned=16 MHz internal - tuned
microchip.menu.clock.12internaltuned=12 MHz internal - tuned
microchip.menu.clock.10internaltuned=10 MHz internal - tuned
microchip.menu.clock.8internaltuned=8 MHz internal - tuned
microchip.menu.clock.6internaltuned=6 MHz internal - tuned
microchip.menu.clock.5internaltuned=5 MHz internal - tuned
microchip.menu.clock.4internaltuned=4 MHz internal - tuned
microchip.menu.clock.1internaltuned=1 MHz internal - tuned
microchip.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
microchip.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
microchip.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
microchip.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
microchip.menu.clock.20internal.build.speed=20
microchip.menu.clock.20internal.build.clocksource=0
microchip.menu.clock.16internal.build.speed=16
microchip.menu.clock.16internal.build.clocksource=0
microchip.menu.clock.10internal.build.speed=10
microchip.menu.clock.10internal.build.clocksource=0
microchip.menu.clock.8internal.build.speed=8
microchip.menu.clock.8internal.build.clocksource=0
microchip.menu.clock.5internal.build.speed=5
microchip.menu.clock.5internal.build.clocksource=0
microchip.menu.clock.4internal.build.speed=4
microchip.menu.clock.4internal.build.clocksource=0
microchip.menu.clock.2internal.build.speed=2
microchip.menu.clock.2internal.build.clocksource=0
microchip.menu.clock.2internal.build.speed=2
microchip.menu.clock.2internal.build.clocksource=0
microchip.menu.clock.1internal.build.speed=1
microchip.menu.clock.1internal.build.clocksource=0
microchip.menu.clock.20internaltuned.build.speed=20
microchip.menu.clock.20internaltuned.build.clocksource=0
microchip.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.16internaltuned.build.speed=16
microchip.menu.clock.16internaltuned.build.clocksource=0
microchip.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.12internaltuned.build.speed=12
microchip.menu.clock.12internaltuned.build.clocksource=0
microchip.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.24internaltuned.build.speed=24
microchip.menu.clock.24internaltuned.build.clocksource=0
microchip.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.25internaltuned.build.speed=25
microchip.menu.clock.25internaltuned.build.clocksource=0
microchip.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.30internaltuned.build.speed=30
microchip.menu.clock.30internaltuned.build.clocksource=0
microchip.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.32internaltuned.build.speed=32
microchip.menu.clock.32internaltuned.build.clocksource=0
microchip.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchip.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
microchip.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
microchip.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
microchip.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
microchip.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
microchip.menu.clock.20internal.bootloader.OSCCFG=0x02
microchip.menu.clock.10internal.bootloader.OSCCFG=0x02
microchip.menu.clock.5internal.bootloader.OSCCFG=0x02

#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
microchip.menu.bodvoltage.1v8=1.8V (5 MHz or less)
microchip.menu.bodvoltage.2v6=2.6V (10 MHz or less)
microchip.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
microchip.menu.bodvoltage.2v1=2.1V (Unofficial)
microchip.menu.bodvoltage.2v9=2.9V (Unofficial)
microchip.menu.bodvoltage.3v3=3.3V (Unofficial)
microchip.menu.bodvoltage.3v7=3.7V (Unofficial)
microchip.menu.bodvoltage.4v0=4.0V (Unofficial)
microchip.menu.bodvoltage.1v8.bootloader.bodlevbits=000
microchip.menu.bodvoltage.2v1.bootloader.bodlevbits=001
microchip.menu.bodvoltage.2v6.bootloader.bodlevbits=010
microchip.menu.bodvoltage.2v9.bootloader.bodlevbits=011
microchip.menu.bodvoltage.3v3.bootloader.bodlevbits=100
microchip.menu.bodvoltage.3v7.bootloader.bodlevbits=101
microchip.menu.bodvoltage.4v0.bootloader.bodlevbits=110
microchip.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
microchip.menu.bodmode.disabled=Disabled/Disabled
microchip.menu.bodmode.enabled=Enabled/Enabled
microchip.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
microchip.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
microchip.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
microchip.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
microchip.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
microchip.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
microchip.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
microchip.menu.bodmode.disabled.bootloader.BODCFG=0x00
microchip.menu.bodmode.enabled.bootloader.bodmodebits=00101
microchip.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
microchip.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
microchip.menu.bodmode.sampledfast.bootloader.bodmodebits=01010
microchip.menu.bodmode.sampledlow.bootloader.bodmodebits=11010
microchip.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
microchip.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
microchip.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

