SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atxy7o.menu.startuptimeopti.8=8ms
atxy7o.menu.startuptimeopti.0=0ms
atxy7o.menu.startuptimeopti.1=1ms
atxy7o.menu.startuptimeopti.2=2ms
atxy7o.menu.startuptimeopti.4=4ms
atxy7o.menu.startuptimeopti.16=16ms
atxy7o.menu.startuptimeopti.32=32ms
atxy7o.menu.startuptimeopti.64=64ms
atxy7o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy7o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy7o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy7o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy7o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy7o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy7o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy7o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
atxy7o.menu.bootloaderuart.default=TX:9 (PB2), RX:8 (PB3)
atxy7o.menu.bootloaderuart.alternate=TX:18 (PA1), RX:19 (PA2)
atxy7o.menu.bootloaderuart.default.bootloader.uartswap=
atxy7o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy7o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy7o.menu.wiremode.mors.build.wire=MORS
atxy7o.menu.wiremode.mands=Master and Slave
atxy7o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy7o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy7o.menu.printf.full=Full, 2.6k, prints floats
atxy7o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy7o.menu.printf.full.build.printfabr=.pfF
atxy7o.menu.printf.minimal=Minimal, 1.1k flash used
atxy7o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy7o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy7o.menu.attach.allenabled=On all pins, with new implementation.
atxy7o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy7o.menu.attach.manual=Only enabled ports
atxy7o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy7o.menu.attach.oldversion=Old version, (may fix bugs)
atxy7o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy7o.menu.attach.manual.build.attachabr=.aMan
atxy7o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                    ##   ###
#  2-series                      ##   #  #     ####   ###  #   #    ##   ###
#                               #  #  #  #     #   #   #   ##  #    ##   ###
#  ATtiny3227/1627                #   #### === ####    #   # # #    ##   ###
#  ATtiny827/427                 #       #     #       #   #  ##    ##   ###
#                               ####     #     #      ###  #   #    ##   ###
#___________________________________________________________________##___###

#----------------------------------------#
# BUILD PARAMETERS                       #
#________________________________________#
atx27o.build.text_section_start=.text=0x200
atx27o.build.millistimer=B1
atx27o.build.bootload=opti
atx27o.build.board=AVR_ATtinyxy7
atx27o.build.clocksource=0
atx27o.build.core=megatinycore
atx27o.build.mrelax= -mrelax
atx27o.build.variant=txy7
atx27o.build.tuned=
atx27o.build.printf=
atx27o.build.wire=MORS
atx27o.build.attachmode=-DCORE_ATTACH_ALL
atx27o.build.mcu=attiny{build.attiny}
atx27o.build.f_cpu={build.speed}000000L
atx27o.build.extra_flags=-DARDUINO_attinyx27 -DUSING_OPTIBOOT {build.tuned}
atx27o.build.export_merged_output=true

#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atx27o.bootloader.WDTCFG=0x00
atx27o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atx27o.bootloader.OSCCFG=0x01
atx27o.bootloader.TCD0CFG_avrdude=
atx27o.bootloader.TCD0CFG_serialupdi=
atx27o.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}10
atx27o.bootloader.APPEND=0x00
atx27o.bootloader.BOOTEND=0x02
atx27o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atx27o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atx27o.bootloader.file=optiboot_tx2z{bootloader.uartswap}{bootloader.entrycond}.hex
atx27o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atx27o.build.printfabr=
atx27o.build.attachabr=
atx27o.build.wireabr=
atx27o.build.pwmabr=

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atx27o.upload.workaround=
atx27o.upload.tool=avrdude
atx27o.upload.protocol=arduino
atx27o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atx27o.upload.extra_params=-D -P{serial.port}
atx27o.upload.speed=115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 24-pin Optiboot 0/1-series tinyAVR submenus #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atx27o.menu.chip.3227=ATtiny3227
atx27o.menu.chip.3227.build.board=AVR_ATtiny3227
atx27o.menu.chip.3227.build.attiny=3227
atx27o.menu.chip.3227.upload.maximum_size=32256
atx27o.menu.chip.3227.upload.maximum_data_size=3072
atx27o.menu.chip.1627=ATtiny1627
atx27o.menu.chip.1627.build.board=AVR_ATtiny1627
atx27o.menu.chip.1627.build.attiny=1627
atx27o.menu.chip.1627.upload.maximum_size=15872
atx27o.menu.chip.1627.upload.maximum_data_size=2048
atx27o.menu.chip.827=ATtiny827
atx27o.menu.chip.827.build.board=AVR_ATtiny827
atx27o.menu.chip.827.build.attiny=827
atx27o.menu.chip.827.upload.maximum_size=7680
atx27o.menu.chip.827.build.mrelax=
atx27o.menu.chip.827.upload.maximum_data_size=1024
atx27o.menu.chip.427=ATtiny427
atx27o.menu.chip.427.build.board=AVR_ATtiny427
atx27o.menu.chip.427.build.attiny=427
atx27o.menu.chip.427.upload.maximum_size=3584
atx27o.menu.chip.427.build.mrelax=
atx27o.menu.chip.427.upload.maximum_data_size=512

