SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atx27o.menu.startuptimeopti.8=8ms
atx27o.menu.startuptimeopti.0=0ms
atx27o.menu.startuptimeopti.1=1ms
atx27o.menu.startuptimeopti.2=2ms
atx27o.menu.startuptimeopti.4=4ms
atx27o.menu.startuptimeopti.16=16ms
atx27o.menu.startuptimeopti.32=32ms
atx27o.menu.startuptimeopti.64=64ms
atx27o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atx27o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atx27o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atx27o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atx27o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atx27o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atx27o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atx27o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
atx27o.menu.bootloaderuart.default=TX:9 (PB2), RX:8 (PB3) (UART0 default pins)
atx27o.menu.bootloaderuart.alternate=TX:18 (PA1), RX:19 (PA2) (UART0 alt pins)
atx27o.menu.bootloaderuart.alternate1=TX:14 (PC2), RX:13 (PC1) (UART1 alt pins)
atx27o.menu.bootloaderuart.default.bootloader.uartswap=
atx27o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt
atx27o.menu.bootloaderuart.alternate1.bootloader.uartswap=_u1alt

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atx27o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atx27o.menu.wiremode.mors.build.wire=MORS
atx27o.menu.wiremode.mands=Master and Slave
atx27o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atx27o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atx27o.menu.printf.full=Full, 2.6k, prints floats
atx27o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atx27o.menu.printf.full.build.printfabr=.pfF
atx27o.menu.printf.minimal=Minimal, 1.1k flash used
atx27o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atx27o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atx27o.menu.attach.allenabled=On all pins, with new implementation.
atx27o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atx27o.menu.attach.manual=Only enabled ports
atx27o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atx27o.menu.attach.oldversion=Old version, (may fix bugs)
atx27o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atx27o.menu.attach.manual.build.attachabr=.aMan
atx27o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                         ###
#  0/1-series                    ##    ###      ####   ###  #   #        ###
#                               #  #  #   #     #   #   #   ##  #        ###
#  ATtiny3216/1616/1606           #   #   # === ####    #   # # #        ###
#  ATtiny816/806                 #    #   #     #       #   #  ##        ###
#  ATtiny416/406                ####   ###      #      ###  #   #        ###
#________________________________________________________________________###

#----------------------------------------#
# BUILD PARAMETERS                       #
#________________________________________#
atxy6o.build.text_section_start=.text=0x200
atxy6o.build.millistimer=D0
atxy6o.build.bootload=opti
atxy6o.build.board=AVR_ATtinyxy6
atxy6o.build.clocksource=0
atxy6o.build.core=megatinycore
atxy6o.build.mrelax= -mrelax
atxy6o.build.variant=txy6
atxy6o.build.tuned=
atxy6o.build.printf=
atxy6o.build.wire=MORS
atxy6o.build.attachmode=-DCORE_ATTACH_ALL
atxy6o.build.mcu=attiny{build.attiny}
atxy6o.build.f_cpu={build.speed}000000L
atxy6o.build.extra_flags=-DARDUINO_attinyxy6 -DUSING_OPTIBOOT {build.tuned}
atxy6o.build.export_merged_output=true

#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atxy6o.bootloader.WDTCFG=0x00
atxy6o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy6o.bootloader.OSCCFG=0x01
atxy6o.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy6o.bootloader.TCD0CFG_serialupdi=4:0x00
atxy6o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy6o.bootloader.APPEND=0x00
atxy6o.bootloader.BOOTEND=0x02
atxy6o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy6o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atxy6o.bootloader.file=optiboot_txyz{bootloader.uartswap}{bootloader.entrycond}.hex
atxy6o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy6o.build.printfabr=
atxy6o.build.attachabr=
atxy6o.build.wireabr=
atxy6o.build.pwmabr=

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atxy6o.upload.workaround=
atxy6o.upload.tool=avrdude
atxy6o.upload.protocol=arduino
atxy6o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atxy6o.upload.extra_params=-D -P{serial.port}
atxy6o.upload.speed=115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 20-pin Optiboot 0/1-series tinyAVR submenus #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy6o.menu.chip.3216=ATtiny3216
atxy6o.menu.chip.3216.build.board=AVR_ATtiny3216
atxy6o.menu.chip.3216.build.attiny=3216
atxy6o.menu.chip.3216.upload.maximum_size=32256
atxy6o.menu.chip.3216.upload.maximum_data_size=2048
atxy6o.menu.chip.1616=ATtiny1616
atxy6o.menu.chip.1616.build.board=AVR_ATtiny1616
atxy6o.menu.chip.1616.build.attiny=1616
atxy6o.menu.chip.1616.upload.maximum_size=15872
atxy6o.menu.chip.1616.upload.maximum_data_size=2048
atxy6o.menu.chip.1606=ATtiny1606
atxy6o.menu.chip.1606.build.board=AVR_ATtiny1606
atxy6o.menu.chip.1606.build.attiny=1606
atxy6o.menu.chip.1606.build.millistimer=A0
atxy6o.menu.chip.1606.upload.maximum_size=15872
atxy6o.menu.chip.1606.upload.maximum_data_size=1024
atxy6o.menu.chip.1606.bootloader.TCD0CFG_avrdude=
atxy6o.menu.chip.1606.bootloader.TCD0CFG_serialupdi=
atxy6o.menu.chip.816=ATtiny816
atxy6o.menu.chip.816.build.board=AVR_ATtiny816
atxy6o.menu.chip.816.build.attiny=816
atxy6o.menu.chip.816.upload.maximum_size=7680
atxy6o.menu.chip.816.build.mrelax=
atxy6o.menu.chip.816.upload.maximum_data_size=512
atxy6o.menu.chip.806=ATtiny806
atxy6o.menu.chip.806.build.board=AVR_ATtiny806
atxy6o.menu.chip.806.build.attiny=806
atxy6o.menu.chip.806.build.millistimer=A0
atxy6o.menu.chip.806.upload.maximum_size=7680
atxy6o.menu.chip.806.build.mrelax=
atxy6o.menu.chip.806.upload.maximum_data_size=512
atxy6o.menu.chip.806.bootloader.TCD0CFG_avrdude=
atxy6o.menu.chip.806.bootloader.TCD0CFG_serialupdi=
atxy6o.menu.chip.416=ATtiny416
atxy6o.menu.chip.416.build.board=AVR_ATtiny416
atxy6o.menu.chip.416.build.attiny=416
atxy6o.menu.chip.416.upload.maximum_size=3584
atxy6o.menu.chip.416.build.mrelax=
atxy6o.menu.chip.416.upload.maximum_data_size=256
atxy6o.menu.chip.406=ATtiny406
atxy6o.menu.chip.406.build.board=AVR_ATtiny406
atxy6o.menu.chip.406.build.attiny=406
atxy6o.menu.chip.406.build.millistimer=A0
atxy6o.menu.chip.406.upload.maximum_size=3584
atxy6o.menu.chip.406.build.mrelax=
atxy6o.menu.chip.406.upload.maximum_data_size=256
atxy6o.menu.chip.406.bootloader.TCD0CFG_avrdude=
atxy6o.menu.chip.406.bootloader.TCD0CFG_serialupdi=

