SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atxy6o.menu.clocko.20internal=20 MHz internal
atxy6o.menu.clocko.16internal=16 MHz internal
atxy6o.menu.clocko.10internal=10 MHz internal
atxy6o.menu.clocko.8internal=8 MHz internal
atxy6o.menu.clocko.5internal=5 MHz internal
atxy6o.menu.clocko.4internal=4 MHz internal
atxy6o.menu.clocko.2internal=2 MHz internal
atxy6o.menu.clocko.1internal=1 MHz internal
atxy6o.menu.clocko.20internaltuned=20 MHz internal - tuned
atxy6o.menu.clocko.16internaltuned=16 MHz internal - tuned
atxy6o.menu.clocko.12internaltuned=12 MHz internal - tuned
atxy6o.menu.clocko.10internaltuned=10 MHz internal - tuned
atxy6o.menu.clocko.8internaltuned=8 MHz internal - tuned
atxy6o.menu.clocko.6internaltuned=6 MHz internal - tuned
atxy6o.menu.clocko.5internaltuned=5 MHz internal - tuned
atxy6o.menu.clocko.4internaltuned=4 MHz internal - tuned
atxy6o.menu.clocko.2internaltuned=2 MHz internal - tuned
atxy6o.menu.clocko.1internaltuned=1 MHz internal - tuned
atxy6o.menu.clocko.20extclock=20 MHz external clock
atxy6o.menu.clocko.16extclock=16 MHz external clock
atxy6o.menu.clocko.12extclock=12 MHz external clock
atxy6o.menu.clocko.10extclock=10 MHz external clock
atxy6o.menu.clocko.8extclock=8 MHz external clock
atxy6o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atxy6o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atxy6o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy6o.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atxy6o.menu.clocko.24extclock=24 MHz external clock - overclocked
atxy6o.menu.clocko.25extclock=25 MHz external clock - overclocked
atxy6o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atxy6o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atxy6o.menu.clocko.20internal.build.speed=20
atxy6o.menu.clocko.20internal.build.clocksource=0
atxy6o.menu.clocko.16internal.build.speed=16
atxy6o.menu.clocko.16internal.build.clocksource=0
atxy6o.menu.clocko.10internal.build.speed=10
atxy6o.menu.clocko.10internal.build.clocksource=0
atxy6o.menu.clocko.8internal.build.speed=8
atxy6o.menu.clocko.8internal.build.clocksource=0
atxy6o.menu.clocko.5internal.build.speed=5
atxy6o.menu.clocko.5internal.build.clocksource=0
atxy6o.menu.clocko.4internal.build.speed=4
atxy6o.menu.clocko.4internal.build.clocksource=0
atxy6o.menu.clocko.2internal.build.speed=2
atxy6o.menu.clocko.2internal.build.clocksource=0
atxy6o.menu.clocko.1internal.build.speed=1
atxy6o.menu.clocko.1internal.build.clocksource=0
atxy6o.menu.clocko.20extclock.build.speed=20
atxy6o.menu.clocko.20extclock.build.clocksource=2
atxy6o.menu.clocko.16extclock.build.speed=16
atxy6o.menu.clocko.16extclock.build.clocksource=2
atxy6o.menu.clocko.12extclock.build.speed=12
atxy6o.menu.clocko.12extclock.build.clocksource=2
atxy6o.menu.clocko.10extclock.build.speed=10
atxy6o.menu.clocko.10extclock.build.clocksource=2
atxy6o.menu.clocko.8extclock.build.speed=8
atxy6o.menu.clocko.8extclock.build.clocksource=2
atxy6o.menu.clocko.24extclock.build.speed=24
atxy6o.menu.clocko.24extclock.build.clocksource=2
atxy6o.menu.clocko.25extclock.build.speed=24
atxy6o.menu.clocko.25extclock.build.clocksource=2
atxy6o.menu.clocko.30extclock.build.speed=30
atxy6o.menu.clocko.30extclock.build.clocksource=2
atxy6o.menu.clocko.32extclock.build.speed=32
atxy6o.menu.clocko.32extclock.build.clocksource=2
atxy6o.menu.clocko.1internaltuned.build.speed=1
atxy6o.menu.clocko.1internaltuned.build.clocksource=0
atxy6o.menu.clocko.1internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.2internaltuned.build.speed=2
atxy6o.menu.clocko.2internaltuned.build.clocksource=0
atxy6o.menu.clocko.2internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.4internaltuned.build.speed=4
atxy6o.menu.clocko.4internaltuned.build.clocksource=0
atxy6o.menu.clocko.4internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.5internaltuned.build.speed=5
atxy6o.menu.clocko.5internaltuned.build.clocksource=0
atxy6o.menu.clocko.5internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.5internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.6internaltuned.build.speed=6
atxy6o.menu.clocko.6internaltuned.build.clocksource=0
atxy6o.menu.clocko.6internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.8internaltuned.build.speed=8
atxy6o.menu.clocko.8internaltuned.build.clocksource=0
atxy6o.menu.clocko.8internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.10internaltuned.build.speed=10
atxy6o.menu.clocko.10internaltuned.build.clocksource=0
atxy6o.menu.clocko.10internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.10internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.12internaltuned.build.speed=12
atxy6o.menu.clocko.12internaltuned.build.clocksource=0
atxy6o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.12internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.16internaltuned.build.speed=16
atxy6o.menu.clocko.16internaltuned.build.clocksource=0
atxy6o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.20internaltuned.build.speed=20
atxy6o.menu.clocko.20internaltuned.build.clocksource=0
atxy6o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.24internaltuned.build.speed=24
atxy6o.menu.clocko.24internaltuned.build.clocksource=0
atxy6o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.25internaltuned.build.speed=25
atxy6o.menu.clocko.25internaltuned.build.clocksource=0
atxy6o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.30internaltuned.build.speed=30
atxy6o.menu.clocko.30internaltuned.build.clocksource=0
atxy6o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.32internaltuned.build.speed=32
atxy6o.menu.clocko.32internaltuned.build.clocksource=0
atxy6o.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6o.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy6o.menu.clocko.5internal.bootloader.OSCCFG=0x02

