SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atx26o.menu.startuptimeopti.8=8ms
atx26o.menu.startuptimeopti.0=0ms
atx26o.menu.startuptimeopti.1=1ms
atx26o.menu.startuptimeopti.2=2ms
atx26o.menu.startuptimeopti.4=4ms
atx26o.menu.startuptimeopti.16=16ms
atx26o.menu.startuptimeopti.32=32ms
atx26o.menu.startuptimeopti.64=64ms
atx26o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atx26o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atx26o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atx26o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atx26o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atx26o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atx26o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atx26o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
atx26o.menu.bootloaderuart.default=TX:7 (PB2), RX:6 (PB3) (UART0 default pins)
atx26o.menu.bootloaderuart.alternate=TX:14 (PA1), RX:15 (PA2) (UART0 alt pins)
atx26o.menu.bootloaderuart.alternate1=TX:12 (PC2), RX:11 (PC1) (UART1 alt pins)
atx26o.menu.bootloaderuart.default.bootloader.uartswap=
atx26o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt
atx26o.menu.bootloaderuart.alternate1.bootloader.uartswap=_u1alt

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atx26o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atx26o.menu.wiremode.mors.build.wire=MORS
atx26o.menu.wiremode.mands=Master and Slave
atx26o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atx26o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atx26o.menu.printf.full=Full, 2.6k, prints floats
atx26o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atx26o.menu.printf.full.build.printfabr=.pfF
atx26o.menu.printf.minimal=Minimal, 1.1k flash used
atx26o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atx26o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atx26o.menu.attach.allenabled=On all pins, with new implementation.
atx26o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atx26o.menu.attach.manual=Only enabled ports
atx26o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atx26o.menu.attach.oldversion=Old version, (may fix bugs)
atx26o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atx26o.menu.attach.manual.build.attachabr=.aMan
atx26o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                         ###
#  0/1-series                    #    #  #     ####   ###  #   #         ###
#                               ##    #  #     #   #   #   ##  #         ###
#  ATtiny1614/1604               #    #### === ####    #   # # #         ###
#  ATtiny814/804/414             #       #     #       #   #  ##         ###
#  ATtiny404/214/204            ###      #     #      ###  #   #         ###
#________________________________________________________________________###

#----------------------------------------#
# BUILD PARAMETERS                       #
#________________________________________#
atxy4o.build.text_section_start=.text=0x200
atxy4o.build.millistimer=D0
atxy4o.build.bootload=opti
atxy4o.build.board=AVR_ATtinyxy4
atxy4o.build.clocksource=0
atxy4o.build.core=megatinycore
atxy4o.build.mrelax= -mrelax
atxy4o.build.variant=txy4
atxy4o.build.tuned=
atxy4o.build.printf=
atxy4o.build.wire=MORS
atxy4o.build.attachmode=-DCORE_ATTACH_ALL
atxy4o.build.mcu=attiny{build.attiny}
atxy4o.build.f_cpu={build.speed}000000L
atxy4o.build.extra_flags=-DARDUINO_attinyxy4 -DUSING_OPTIBOOT {build.tuned}
atxy4o.build.export_merged_output=true

#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atxy4o.bootloader.WDTCFG=0x00
atxy4o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy4o.bootloader.OSCCFG=0x01
atxy4o.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy4o.bootloader.TCD0CFG_serialupdi=4:0x00
atxy4o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy4o.bootloader.APPEND=0x00
atxy4o.bootloader.BOOTEND=0x02
atxy4o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy4o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atxy4o.bootloader.file=optiboot_txyz{bootloader.uartswap}{bootloader.entrycond}.hex
atxy4o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy4o.build.printfabr=
atxy4o.build.attachabr=
atxy4o.build.wireabr=
atxy4o.build.pwmabr=

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atxy4o.upload.workaround=
atxy4o.upload.tool=avrdude
atxy4o.upload.protocol=arduino
atxy4o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atxy4o.upload.extra_params=-D -P{serial.port}
atxy4o.upload.speed=115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 14-pin Optiboot 0/1-series tinyAVR submenus #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy4o.menu.chip.1614=ATtiny1614
atxy4o.menu.chip.1614.build.board=AVR_ATtiny1614
atxy4o.menu.chip.1614.build.attiny=1614
atxy4o.menu.chip.1614.upload.maximum_size=15872
atxy4o.menu.chip.1614.upload.maximum_data_size=2048
atxy4o.menu.chip.1604=ATtiny1604
atxy4o.menu.chip.1604.build.board=AVR_ATtiny1604
atxy4o.menu.chip.1604.build.attiny=1604
atxy4o.menu.chip.1604.build.millistimer=A0
atxy4o.menu.chip.1604.upload.maximum_size=15872
atxy4o.menu.chip.1604.upload.maximum_data_size=1024
atxy4o.menu.chip.1604.bootloader.TCD0CFG_avrdude=
atxy4o.menu.chip.1604.bootloader.TCD0CFG_serialupdi=
atxy4o.menu.chip.814=ATtiny814
atxy4o.menu.chip.814.build.board=AVR_ATtiny814
atxy4o.menu.chip.814.build.attiny=814
atxy4o.menu.chip.814.upload.maximum_size=7680
atxy4o.menu.chip.814.build.mrelax=
atxy4o.menu.chip.814.upload.maximum_data_size=512
atxy4o.menu.chip.804=ATtiny804
atxy4o.menu.chip.804.build.board=AVR_ATtiny804
atxy4o.menu.chip.804.build.attiny=804
atxy4o.menu.chip.804.build.millistimer=A0
atxy4o.menu.chip.804.upload.maximum_size=7680
atxy4o.menu.chip.804.build.mrelax=
atxy4o.menu.chip.804.upload.maximum_data_size=512
atxy4o.menu.chip.804.bootloader.TCD0CFG_avrdude=
atxy4o.menu.chip.804.bootloader.TCD0CFG_serialupdi=
atxy4o.menu.chip.414=ATtiny414
atxy4o.menu.chip.414.build.board=AVR_ATtiny414
atxy4o.menu.chip.414.build.attiny=414
atxy4o.menu.chip.414.upload.maximum_size=3584
atxy4o.menu.chip.414.build.mrelax=
atxy4o.menu.chip.414.upload.maximum_data_size=256
atxy4o.menu.chip.404=ATtiny404
atxy4o.menu.chip.404.build.board=AVR_ATtiny404
atxy4o.menu.chip.404.build.attiny=404
atxy4o.menu.chip.404.build.millistimer=A0
atxy4o.menu.chip.404.upload.maximum_size=3584
atxy4o.menu.chip.404.build.mrelax=
atxy4o.menu.chip.404.upload.maximum_data_size=256
atxy4o.menu.chip.404.bootloader.TCD0CFG_avrdude=
atxy4o.menu.chip.404.bootloader.TCD0CFG_serialupdi=
atxy4o.menu.chip.214=ATtiny214
atxy4o.menu.chip.214.build.board=AVR_ATtiny214
atxy4o.menu.chip.214.build.attiny=214
atxy4o.menu.chip.214.upload.maximum_size=1536
atxy4o.menu.chip.214.build.mrelax=
atxy4o.menu.chip.214.upload.maximum_data_size=128
atxy4o.menu.chip.204=ATtiny204
atxy4o.menu.chip.204.build.board=AVR_ATtiny204
atxy4o.menu.chip.204.build.attiny=204
atxy4o.menu.chip.204.build.millistimer=A0
atxy4o.menu.chip.204.upload.maximum_size=1536
atxy4o.menu.chip.204.build.mrelax=
atxy4o.menu.chip.204.upload.maximum_data_size=128
atxy4o.menu.chip.204.bootloader.TCD0CFG_avrdude=
atxy4o.menu.chip.204.bootloader.TCD0CFG_serialupdi=

