SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy4o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy4o.menu.wiremode.mors.build.wire=MORS
atxy4o.menu.wiremode.mands=Master and Slave
atxy4o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy4o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy4o.menu.printf.full=Full, 2.6k, prints floats
atxy4o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy4o.menu.printf.full.build.printfabr=.pfF
atxy4o.menu.printf.minimal=Minimal, 1.1k flash used
atxy4o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy4o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy4o.menu.attach.allenabled=On all pins, with new implementation.
atxy4o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy4o.menu.attach.manual=Only enabled ports
atxy4o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy4o.menu.attach.oldversion=Old version, (may fix bugs)
atxy4o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy4o.menu.attach.manual.build.attachabr=.aMan
atxy4o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                    ##   ###
#  2-series                      #    #  #     ####   ###  #   #    ##   ###
#                               ##    #  #     #   #   #   ##  #    ##   ###
#  ATtiny3224/1624               #    #### ### ####    #   # # #    ##   ###
#  ATtiny824/424                 #       #     #       #   #  ##    ##   ###
#                               ###      #     #      ###  #   #    ##   ###
#___________________________________________________________________##___###

#----------------------------------------#
# BUILD PARAMETERS                       #
#________________________________________#
atx24o.build.text_section_start=.text=0x200
atx24o.build.millistimer=B1
atx24o.build.bootload=opti
atx24o.build.board=AVR_ATtinyxy4
atx24o.build.clocksource=0
atx24o.build.core=megatinycore
atx24o.build.mrelax= -mrelax
atx24o.build.variant=txy4
atx24o.build.tuned=
atx24o.build.printf=
atx24o.build.wire=MORS
atx24o.build.attachmode=-DCORE_ATTACH_ALL
atx24o.build.mcu=attiny{build.attiny}
atx24o.build.f_cpu={build.speed}000000L
atx24o.build.extra_flags=-DARDUINO_attinyx24 -DUSING_OPTIBOOT {build.tuned}
atx24o.build.export_merged_output=true

#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atx24o.bootloader.WDTCFG=0x00
atx24o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atx24o.bootloader.OSCCFG=0x01
atx24o.bootloader.TCD0CFG_avrdude=
atx24o.bootloader.TCD0CFG_serialupdi=
atx24o.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}10
atx24o.bootloader.APPEND=0x00
atx24o.bootloader.BOOTEND=0x02
atx24o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atx24o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atx24o.bootloader.file=optiboot_tx2z{bootloader.uartswap}{bootloader.entrycond}.hex
atx24o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atx24o.build.printfabr=
atx24o.build.attachabr=
atx24o.build.wireabr=
atx24o.build.pwmabr=

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atx24o.upload.workaround=
atx24o.upload.tool=avrdude
atx24o.upload.protocol=arduino
atx24o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atx24o.upload.extra_params=-D -P{serial.port}
atx24o.upload.speed=115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 14-pin Optiboot 2-series tinyAVR submenus   #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atx24o.menu.chip.3224=ATtiny3224
atx24o.menu.chip.3224.build.board=AVR_ATtiny3224
atx24o.menu.chip.3224.build.attiny=3224
atx24o.menu.chip.3224.upload.maximum_size=32256
atx24o.menu.chip.3224.upload.maximum_data_size=3072
atx24o.menu.chip.1624=ATtiny1624
atx24o.menu.chip.1624.build.board=AVR_ATtiny1624
atx24o.menu.chip.1624.build.attiny=1624
atx24o.menu.chip.1624.upload.maximum_size=15872
atx24o.menu.chip.1624.upload.maximum_data_size=2048
atx24o.menu.chip.824=ATtiny824
atx24o.menu.chip.824.build.board=AVR_ATtiny824
atx24o.menu.chip.824.build.attiny=824
atx24o.menu.chip.824.upload.maximum_size=7680
atx24o.menu.chip.824.build.mrelax=
atx24o.menu.chip.824.upload.maximum_data_size=1024
atx24o.menu.chip.424=ATtiny424
atx24o.menu.chip.424.build.board=AVR_ATtiny424
atx24o.menu.chip.424.build.attiny=424
atx24o.menu.chip.424.upload.maximum_size=3584
atx24o.menu.chip.424.build.mrelax=
atx24o.menu.chip.424.upload.maximum_data_size=512

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atx24o.menu.clocko.20internal=20 MHz internal
atx24o.menu.clocko.16internal=16 MHz internal
atx24o.menu.clocko.10internal=10 MHz internal
atx24o.menu.clocko.8internal=8 MHz internal
atx24o.menu.clocko.5internal=5 MHz internal
atx24o.menu.clocko.4internal=4 MHz internal
atx24o.menu.clocko.2internal=2 MHz internal
atx24o.menu.clocko.1internal=1 MHz internal
atx24o.menu.clocko.20internaltuned=20 MHz internal - tuned
atx24o.menu.clocko.16internaltuned=16 MHz internal - tuned
atx24o.menu.clocko.12internaltuned=12 MHz internal - tuned
atx24o.menu.clocko.10internaltuned=10 MHz internal - tuned
atx24o.menu.clocko.8internaltuned=8 MHz internal - tuned
atx24o.menu.clocko.6internaltuned=6 MHz internal - tuned
atx24o.menu.clocko.5internaltuned=5 MHz internal - tuned
atx24o.menu.clocko.4internaltuned=4 MHz internal - tuned
atx24o.menu.clocko.2internaltuned=2 MHz internal - tuned
atx24o.menu.clocko.1internaltuned=1 MHz internal - tuned
atx24o.menu.clocko.20extclock=20 MHz external clock
atx24o.menu.clocko.16extclock=16 MHz external clock
atx24o.menu.clocko.12extclock=12 MHz external clock
atx24o.menu.clocko.10extclock=10 MHz external clock
atx24o.menu.clocko.8extclock=8 MHz external clock
atx24o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atx24o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atx24o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atx24o.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atx24o.menu.clocko.24extclock=24 MHz external clock - overclocked
atx24o.menu.clocko.25extclock=25 MHz external clock - overclocked
atx24o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atx24o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atx24o.menu.clocko.20internal.build.speed=20
atx24o.menu.clocko.20internal.build.clocksource=0
atx24o.menu.clocko.16internal.build.speed=16
atx24o.menu.clocko.16internal.build.clocksource=0
atx24o.menu.clocko.10internal.build.speed=10
atx24o.menu.clocko.10internal.build.clocksource=0
atx24o.menu.clocko.8internal.build.speed=8
atx24o.menu.clocko.8internal.build.clocksource=0
atx24o.menu.clocko.5internal.build.speed=5
atx24o.menu.clocko.5internal.build.clocksource=0
atx24o.menu.clocko.4internal.build.speed=4
atx24o.menu.clocko.4internal.build.clocksource=0
atx24o.menu.clocko.2internal.build.speed=2
atx24o.menu.clocko.2internal.build.clocksource=0
atx24o.menu.clocko.1internal.build.speed=1
atx24o.menu.clocko.1internal.build.clocksource=0
atx24o.menu.clocko.20extclock.build.speed=20
atx24o.menu.clocko.20extclock.build.clocksource=2
atx24o.menu.clocko.16extclock.build.speed=16
atx24o.menu.clocko.16extclock.build.clocksource=2
atx24o.menu.clocko.12extclock.build.speed=12
atx24o.menu.clocko.12extclock.build.clocksource=2
atx24o.menu.clocko.10extclock.build.speed=10
atx24o.menu.clocko.10extclock.build.clocksource=2
atx24o.menu.clocko.8extclock.build.speed=8
atx24o.menu.clocko.8extclock.build.clocksource=2
atx24o.menu.clocko.24extclock.build.speed=24
atx24o.menu.clocko.24extclock.build.clocksource=2
atx24o.menu.clocko.25extclock.build.speed=24
atx24o.menu.clocko.25extclock.build.clocksource=2
atx24o.menu.clocko.30extclock.build.speed=30
atx24o.menu.clocko.30extclock.build.clocksource=2
atx24o.menu.clocko.32extclock.build.speed=32
atx24o.menu.clocko.32extclock.build.clocksource=2
atx24o.menu.clocko.1internaltuned.build.speed=1
atx24o.menu.clocko.1internaltuned.build.clocksource=0
atx24o.menu.clocko.1internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.2internaltuned.build.speed=2
atx24o.menu.clocko.2internaltuned.build.clocksource=0
atx24o.menu.clocko.2internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.4internaltuned.build.speed=4
atx24o.menu.clocko.4internaltuned.build.clocksource=0
atx24o.menu.clocko.4internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.5internaltuned.build.speed=5
atx24o.menu.clocko.5internaltuned.build.clocksource=0
atx24o.menu.clocko.5internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.5internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.6internaltuned.build.speed=6
atx24o.menu.clocko.6internaltuned.build.clocksource=0
atx24o.menu.clocko.6internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.8internaltuned.build.speed=8
atx24o.menu.clocko.8internaltuned.build.clocksource=0
atx24o.menu.clocko.8internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.10internaltuned.build.speed=10
atx24o.menu.clocko.10internaltuned.build.clocksource=0
atx24o.menu.clocko.10internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.10internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.12internaltuned.build.speed=12
atx24o.menu.clocko.12internaltuned.build.clocksource=0
atx24o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.12internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.16internaltuned.build.speed=16
atx24o.menu.clocko.16internaltuned.build.clocksource=0
atx24o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.20internaltuned.build.speed=20
atx24o.menu.clocko.20internaltuned.build.clocksource=0
atx24o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.24internaltuned.build.speed=24
atx24o.menu.clocko.24internaltuned.build.clocksource=0
atx24o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.25internaltuned.build.speed=25
atx24o.menu.clocko.25internaltuned.build.clocksource=0
atx24o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.30internaltuned.build.speed=30
atx24o.menu.clocko.30internaltuned.build.clocksource=0
atx24o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.32internaltuned.build.speed=32
atx24o.menu.clocko.32internaltuned.build.clocksource=0
atx24o.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atx24o.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
atx24o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atx24o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atx24o.menu.clocko.5internal.bootloader.OSCCFG=0x02

