SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atx24o.menu.millis.enabled=Enabled (default timer, TCB1)
atx24o.menu.millis.disabled=Disabled (saves flash)
atx24o.menu.millis.timera=TCA0
atx24o.menu.millis.timerb0=TCB0
atx24o.menu.millis.timerb1=TCB1 (default)
atx24o.menu.millis.rtc=RTC (no micros)
atx24o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal
atx24o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator
atx24o.menu.millis.disabled.build.millistimer=NONE
atx24o.menu.millis.timera.build.millistimer=A0
atx24o.menu.millis.timerb0.build.millistimer=B0
atx24o.menu.millis.timerb1.build.millistimer=B1
atx24o.menu.millis.rtc.build.millistimer=RTC
atx24o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atx24o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# BODVOLTAGE                             #
#________________________________________#
atx24o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atx24o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atx24o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atx24o.menu.bodvoltage.2v1=2.1V (Unofficial)
atx24o.menu.bodvoltage.2v9=2.9V (Unofficial)
atx24o.menu.bodvoltage.3v3=3.3V (Unofficial)
atx24o.menu.bodvoltage.3v7=3.7V (Unofficial)
atx24o.menu.bodvoltage.4v0=4.0V (Unofficial)
atx24o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atx24o.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atx24o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atx24o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atx24o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atx24o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atx24o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atx24o.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BODMODE                                #
#________________________________________#
atx24o.menu.bodmode.disabled=Disabled/Disabled
atx24o.menu.bodmode.enabled=Enabled/Enabled
atx24o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atx24o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atx24o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atx24o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atx24o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atx24o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atx24o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atx24o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atx24o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atx24o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atx24o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atx24o.menu.bodmode.sampledfast.bootloader.bodmodebits=01010
atx24o.menu.bodmode.sampledlow.bootloader.bodmodebits=11010
atx24o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atx24o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atx24o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
#  UPDI and RESET PIN configuration      #
#----------------------------------------#
atx24o.menu.resetpinopti.UPDI=UPDI, (default optiboot for 8 sec. after all resets)
atx24o.menu.resetpinopti.UPDI.bootloader.defaultentrycond=_all8sec
atx24o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atx24o.menu.resetpinopti.reset=Reset, (default ptiboot for 1 sec. after ext. reset) *DANGER* HV UPDI programmer req'd for reprogramming!
atx24o.menu.resetpinopti.reset.bootloader.defaultentrycond=_extr
atx24o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atx24o.menu.resetpinopti.gpio=(weak) GPIO, (default optiboot for 8 sec. after all resets) *DANGER* HV programmer req'd for reprogramming! (PCHV)
atx24o.menu.resetpinopti.gpio.bootloader.defaultentrycond=_all8sec
atx24o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atx24o.menu.startuptimeopti.8=8ms
atx24o.menu.startuptimeopti.0=0ms
atx24o.menu.startuptimeopti.1=1ms
atx24o.menu.startuptimeopti.2=2ms
atx24o.menu.startuptimeopti.4=4ms
atx24o.menu.startuptimeopti.16=16ms
atx24o.menu.startuptimeopti.32=32ms
atx24o.menu.startuptimeopti.64=64ms
atx24o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atx24o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atx24o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atx24o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atx24o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atx24o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atx24o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atx24o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
atx24o.menu.bootloaderuart.default=TX:5 (PB2), RX:4 (PB3) (UART0 default pins)
atx24o.menu.bootloaderuart.alternate=TX:8 (PA1), RX:9 (PA2) (UART0 alt/UART1 default pins)
atx24o.menu.bootloaderuart.default.bootloader.uartswap=
atx24o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

#----------------------------------------#
# BOOTLOADER Entry Conditions            #
#________________________________________#
atx24o.menu.entrycond.default=Default (Always enter bootloader 8 second delay - unless UPDI fused as reset, then extrf 1 second)
atx24o.menu.entrycond.all=Always: Every reset except a WDT reset or BOR w/out POR, 8 second timeout - easy to enter bootloader
atx24o.menu.entrycond.poronly= Power On Only: Only when chip is powercycled, 8 second timeout (assume manual unplug)
atx24o.menu.entrycond.swr=SW-only: 8 second timeout (Warning: bad app code won't run the bootloader)
atx24o.menu.entrycond.extr=External (reset pin): Reset pin and SW reset, 1 second timeout (assume autoreset, requires UPDI fused as reset).
atx24o.menu.entrycond.extronly=External reset only: 1 second timeout (assume autoreset, requires UPDI fused as reset)
atx24o.menu.entrycond.extr_slow=External (reset pin), slow: Reset pin and SW reset, 8 second timeout (assume manual reset, requires UPDI fused as reset)
atx24o.menu.entrycond.porswr=POR and SWR, but not external resets.
atx24o.menu.entrycond.default.bootloader.entrycond={bootloader.defaultentrycond}
atx24o.menu.entrycond.extr.bootloader.entrycond=_extr
atx24o.menu.entrycond.extronly.bootloader.entrycond=_extronly
atx24o.menu.entrycond.poronly.bootloader.entrycond=_poronly8sec
atx24o.menu.entrycond.all.bootloader.entrycond=_all8sec
atx24o.menu.entrycond.swr.bootloader.entrycond=_swronly8sec
atx24o.menu.entrycond.extr_slow.bootloader.entrycond=_extr8sec
atx24o.menu.entrycond.porswr.bootloader.entrycond=_porswr8sec

