SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy2o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy2o.menu.wiremode.mors.build.wire=MORS
atxy2o.menu.wiremode.mands=Master and Slave (412 and 212 only)
atxy2o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy2o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy2o.menu.printf.full=Full, 2.6k, prints floats
atxy2o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy2o.menu.printf.full.build.printfabr=.pfF
atxy2o.menu.printf.minimal=Minimal, 1.1k flash used
atxy2o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy2o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy2o.menu.attach.allenabled=On all pins, with new implementation.
atxy2o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy2o.menu.attach.manual=Only enabled ports
atxy2o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy2o.menu.attach.oldversion=Old version, (may fix bugs)
atxy2o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy2o.menu.attach.manual.build.attachabr=.aMan
atxy2o.menu.attach.oldversion.build.attachabr=.aOld

##########################################################################
#                                                                        #
# Curiosity Nano    #   # ###  ### ####   ###   ### #  # ### ####      ###
# Xplained Mini     ## ##  #  #    #   # #   # #    #  #  #  #   #   #####
# Xplained Pro      # # #  #  #    ####  #   # #    ####  #  ####  #######
# WITH OPTIBOOT     #   #  #  #    # #   #   # #    #  #  #  #       #####
#                   #   # ###  ### #  ##  ###   ### #  # ### #         ###
#________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
microchipo.build.text_section_start=.text=0x200
microchipo.build.board=AVR_MicrochipOfficial
microchipo.build.millistimer=D0
microchipo.build.bootload=opti
microchipo.build.clocksource=0
microchipo.build.core=megatinycore
microchipo.build.mrelax= -mrelax
microchipo.build.mcu=attiny{build.attiny}
microchipo.build.f_cpu={build.speed}000000L
microchipo.build.tuned=
microchipo.build.printf=
microchipo.build.wire=MORS
microchipo.build.attachmode=-DCORE_ATTACH_ALL
microchipo.build.export_merged_output=false
microchipo.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
microchipo.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
microchipo.bootloader.file={bootloader.basefilename}{bootloader.entrycond}.hex

#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
microchipo.bootloader.WDTCFG=0x00
microchipo.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
microchipo.bootloader.OSCCFG=0x01
microchipo.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
microchipo.bootloader.TCD0CFG_serialupdi=4:0x00
microchipo.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
microchipo.bootloader.APPEND=0x00
microchipo.bootloader.BOOTEND=0x00
microchipo.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
microchipo.build.printfabr=
microchipo.build.wireabr=
microchipo.build.attachabr=
microchipo.build.pwmabr=

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
microchipo.upload.workaround=
microchipo.upload.tool=avrdude
microchipo.upload.protocol=arduino
microchipo.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
microchipo.upload.extra_params=-D -P{serial.port}
microchipo.upload.speed=115200

#----------------------------------------#
# CHIP                                   #
#________________________________________#
microchipo.menu.board_name.cn3217=Curiosity Nano ATtiny3217
microchipo.menu.board_name.cn3217.build.board=AVR_CuriosityNano3217
microchipo.menu.board_name.cn3217.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PA3 -DPIN_BUTTON_BUILTIN=PIN_PB7 {build.tuned}
microchipo.menu.board_name.cn3217.bootloader.basefilename=optiboot_curiosity3217
microchipo.menu.board_name.cn3217.build.attiny=3217
microchipo.menu.board_name.cn3217.build.variant=txy7
microchipo.menu.board_name.cn3217.build.millistimer=D0
microchipo.menu.board_name.cn3217.upload.maximum_size=32256
microchipo.menu.board_name.cn3217.upload.maximum_data_size=2048

microchipo.menu.board_name.cn1627=Curiosity Nano ATtiny1627
microchipo.menu.board_name.cn1627.build.board=AVR_CuriosityNano1627
microchipo.menu.board_name.cn1627.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB7 {build.tuned}
microchipo.menu.board_name.cn1627.bootloader.basefilename=optiboot_curiosity1627
microchipo.menu.board_name.cn1627.build.millistimer=B1
microchipo.menu.board_name.cn1627.build.attiny=1627
microchipo.menu.board_name.cn1627.build.variant=txy7
microchipo.menu.board_name.cn1627.bootloader.altreset=11
microchipo.menu.board_name.cn1627.upload.maximum_size=15872
microchipo.menu.board_name.cn1627.upload.maximum_data_size=2048
microchipo.menu.board_name.cn1627.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}10
microchipo.menu.board_name.cn1627.bootloader.TCD0CFG_avrdude=
microchipo.menu.board_name.cn1627.bootloader.TCD0CFG_serialupdi=

microchipo.menu.board_name.cn1607=Curiosity Nano ATtiny1607
microchipo.menu.board_name.cn1607.build.board=AVR_CuriosityNano1607
microchipo.menu.board_name.cn1607.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PC4 -DPIN_BUTTON_BUILTIN=PIN_PB7 {build.tuned}
microchipo.menu.board_name.cn1607.bootloader.basefilename=optiboot_curiosity1607
microchipo.menu.board_name.cn1607.build.attiny=1607
microchipo.menu.board_name.cn1607.build.variant=txy7
microchipo.menu.board_name.cn1607.build.millistimer=A0
microchipo.menu.board_name.cn1607.upload.maximum_size=15872
microchipo.menu.board_name.cn1607.upload.maximum_data_size=1024
microchipo.menu.board_name.cn1607.bootloader.TCD0CFG_avrdude=
microchipo.menu.board_name.cn1607.bootloader.TCD0CFG_serialupdi=

