SpenceKonde/megaTinyCore/megaavr/boards.txt
microchipo.menu.board_name.xp3217=Xplained Pro ATtiny3217
microchipo.menu.board_name.xp3217.build.board=AVR_XplainedPro3217
microchipo.menu.board_name.xp3217.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB5 {build.tuned}
microchipo.menu.board_name.xp3217.bootloader.basefilename=optiboot_xplainedpro3217
microchipo.menu.board_name.xp3217.build.attiny=3217
microchipo.menu.board_name.xp3217.build.variant=txy7
microchipo.menu.board_name.xp3217.build.millistimer=D0
microchipo.menu.board_name.xp3217.upload.maximum_size=32256
microchipo.menu.board_name.xp3217.upload.maximum_data_size=2048

microchipo.menu.board_name.xp817=Xplained Pro ATtiny817
microchipo.menu.board_name.xp817.build.board=AVR_XplainedPro817
microchipo.menu.board_name.xp817.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PB4 -DPIN_BUTTON_BUILTIN=PIN_PB5 {build.tuned}
microchipo.menu.board_name.xp817.bootloader.basefilename=optiboot_xplainedpro817
microchipo.menu.board_name.xp817.build.attiny=817
microchipo.menu.board_name.xp817.build.variant=txy7
microchipo.menu.board_name.xp817.build.millistimer=D0
microchipo.menu.board_name.xp817.upload.maximum_size=7680
microchipo.menu.board_name.xp817.build.mrelax=
microchipo.menu.board_name.xp817.upload.maximum_data_size=512

microchipo.menu.board_name.xm817=Xplained Mini ATtiny817
microchipo.menu.board_name.xm817.build.board=AVR_XplainedMini817
microchipo.menu.board_name.xm817.build.extra_flags=-DARDUINO_attinyxy7 -DLED_BUILTIN=PIN_PC0 -DPIN_BUTTON_BUILTIN=PIN_PC5 {build.tuned}
microchipo.menu.board_name.xm817.bootloader.basefilename=optiboot_xplainedmini817
microchipo.menu.board_name.xm817.build.attiny=817
microchipo.menu.board_name.xm817.build.variant=txy7
microchipo.menu.board_name.xm817.build.millistimer=D0
microchipo.menu.board_name.xm817.upload.maximum_size=7680
microchipo.menu.board_name.xm817.build.mrelax=
microchipo.menu.board_name.xm817.upload.maximum_data_size=512

microchipo.menu.board_name.xn416=Xplained Nano ATtiny416
microchipo.menu.board_name.xn416.build.board=AVR_XplainedNano416
microchipo.menu.board_name.xn416.build.extra_flags=-DARDUINO_attinyxy6 -DLED_BUILTIN=PIN_PB5 -DPIN_BUTTON_BUILTIN=PIN_PB4 -DUART0_SWAP {build.tuned}
microchipo.menu.board_name.xn416.bootloader.basefilename=optiboot_xplainednano416
microchipo.menu.board_name.xn416.build.attiny=416
microchipo.menu.board_name.xn416.build.variant=txy6
microchipo.menu.board_name.xn416.build.millistimer=D0
microchipo.menu.board_name.xn416.upload.maximum_size=3584
microchipo.menu.board_name.xn416.build.mrelax=
microchipo.menu.board_name.xn416.upload.maximum_data_size=256

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
microchipo.menu.clocko.20internal=20 MHz internal
microchipo.menu.clocko.16internal=16 MHz internal
microchipo.menu.clocko.10internal=10 MHz internal
microchipo.menu.clocko.8internal=8 MHz internal
microchipo.menu.clocko.5internal=5 MHz internal
microchipo.menu.clocko.4internal=4 MHz internal
microchipo.menu.clocko.2internal=2 MHz internal
microchipo.menu.clocko.1internal=1 MHz internal
microchipo.menu.clocko.20internaltuned=20 MHz internal - tuned
microchipo.menu.clocko.16internaltuned=16 MHz internal - tuned
microchipo.menu.clocko.12internaltuned=12 MHz internal - tuned
microchipo.menu.clocko.10internaltuned=10 MHz internal - tuned
microchipo.menu.clocko.8internaltuned=8 MHz internal - tuned
microchipo.menu.clocko.6internaltuned=6 MHz internal - tuned
microchipo.menu.clocko.5internaltuned=5 MHz internal - tuned
microchipo.menu.clocko.4internaltuned=4 MHz internal - tuned
microchipo.menu.clocko.1internaltuned=1 MHz internal - tuned
microchipo.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
microchipo.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
microchipo.menu.clocko.30internaltuned=30 MHz internal - tuned, very overclocked, may be unstable, req. 20 MHz fuse
microchipo.menu.clocko.32internaltuned=32 MHz internal - tuned, c1627 only, very overclocked, may be unstable, req. 20 MHz fuse
microchipo.menu.clocko.20internal.build.speed=20
microchipo.menu.clocko.20internal.build.clocksource=0
microchipo.menu.clocko.16internal.build.speed=16
microchipo.menu.clocko.16internal.build.clocksource=0
microchipo.menu.clocko.10internal.build.speed=10
microchipo.menu.clocko.10internal.build.clocksource=0
microchipo.menu.clocko.8internal.build.speed=8
microchipo.menu.clocko.8internal.build.clocksource=0
microchipo.menu.clocko.5internal.build.speed=5
microchipo.menu.clocko.5internal.build.clocksource=0
microchipo.menu.clocko.4internal.build.speed=4
microchipo.menu.clocko.4internal.build.clocksource=0
microchipo.menu.clocko.2internal.build.speed=2
microchipo.menu.clocko.2internal.build.clocksource=0
microchipo.menu.clocko.1internal.build.speed=1
microchipo.menu.clocko.1internal.build.clocksource=0
microchipo.menu.clocko.20internaltuned.build.speed=20
microchipo.menu.clocko.20internaltuned.build.clocksource=0
microchipo.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.16internaltuned.build.speed=16
microchipo.menu.clocko.16internaltuned.build.clocksource=0
microchipo.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.12internaltuned.build.speed=12
microchipo.menu.clocko.12internaltuned.build.clocksource=0
microchipo.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.24internaltuned.build.speed=24
microchipo.menu.clocko.24internaltuned.build.clocksource=0
microchipo.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.25internaltuned.build.speed=25
microchipo.menu.clocko.25internaltuned.build.clocksource=0
microchipo.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.30internaltuned.build.speed=30
microchipo.menu.clocko.30internaltuned.build.clocksource=0
microchipo.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.32internaltuned.build.speed=32
microchipo.menu.clocko.32internaltuned.build.clocksource=0
microchipo.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
microchipo.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
microchipo.menu.clocko.20internal.bootloader.OSCCFG=0x02
microchipo.menu.clocko.10internal.bootloader.OSCCFG=0x02
microchipo.menu.clocko.5internal.bootloader.OSCCFG=0x02

